**Import the required libraries**

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import math
import os
import datetime as dt
import warnings
warnings.filterwarnings("ignore")
import glob

In [48]:
path = r"C:\Users\subha\Downloads\Sales data"
csv_files = glob.glob(os.path.join(path, "*.csv"))
list = []
for file_name in csv_files:
    df = pd.read_csv(file_name, index_col= None , header = 0)
    list.append(df)
df = pd.concat(list, axis = 0, ignore_index= True)
df.head()

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 186850 entries, 0 to 186849
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          186305 non-null  object
 1   Product           186305 non-null  object
 2   Quantity Ordered  186305 non-null  object
 3   Price Each        186305 non-null  object
 4   Order Date        186305 non-null  object
 5   Purchase Address  186305 non-null  object
dtypes: object(6)
memory usage: 8.6+ MB

In [52]:
df.describe(include="all")

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
count,186305,186305,186305,186305,186305,186305
unique,178438,20,10,24,142396,140788
top,Order ID,USB-C Charging Cable,1,11.95,Order Date,Purchase Address
freq,355,21903,168552,21903,355,355

In [53]:
#formatting the names of the columns for the given dataframe
for i in df:
    df.columns = df.columns.astype(str)
    df.columns = df.columns.str.strip(" ")
    df.columns = df.columns.str.lower()
    df.columns = df.columns.str.replace(" ","_")
df.head()

,order_id,product,quantity_ordered,price_each,order_date,purchase_address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [54]:
#checking the number and presence of missing values in the main dataframe
df.isna().sum()

order_id            545
product             545
quantity_ordered    545
price_each          545
order_date          545
purchase_address    545
dtype: int64

In [55]:
#trying to understand the meaning of the meaning of missing values in the main dataframe
df_null = df.loc[df['order_id'].isnull()]
df_null.describe(include="all")

,order_id,product,quantity_ordered,price_each,order_date,purchase_address
count,0,0,0,0,0,0
unique,0,0,0,0,0,0
top,NaN,NaN,NaN,NaN,NaN,NaN
freq,NaN,NaN,NaN,NaN,NaN,NaN

In [67]:
#cleaning the dataframe which is required
df = df.loc[df['order_id'].notnull()]
df = df.loc[df['order_date'].notnull()]
df['order_date'] = pd.to_datetime(df['order_date'], errors = "coerce")
df['order_id'] = df['order_id'].astype(int)
df['quantity_ordered'] = df['quantity_ordered'].astype(int)
df['price_each'] = df['price_each'].astype(float)
df.head()

,order_id,product,quantity_ordered,price_each,order_date,purchase_address
0,176558,USB-C Charging Cable,2,11.95,2019-04-19 08:46:00,"917 1st St, Dallas, TX 75001"
2,176559,Bose SoundSport Headphones,1,99.99,2019-04-07 22:30:00,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600.00,2019-04-12 14:38:00,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,2019-04-12 14:38:00,"669 Spruce St, Los Angeles, CA 90001"
5,176561,Wired Headphones,1,11.99,2019-04-30 09:27:00,"333 8th St, Los Angeles, CA 90001"

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 185950 entries, 0 to 186849
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   order_id          185950 non-null  int32
 1   product           185950 non-null  object
 2   quantity_ordered  185950 non-null  int32
 3   price_each        185950 non-null  float64
 4   order_date        185950 non-null  datetime64[ns]
 5   purchase_address  185950 non-null  object
dtypes: datetime64[ns](1), float64(1), int32(2), object(2)
memory usage: 8.5+ MB